АлогистикТест2/src/AccumulationRegisters/алк_ОстаткиЗапасов/алк_ОстаткиЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ОстаткиЗапасов</name>
  <resources>
    <name>Количество</name>
    <comment>Для пиловочника и пилмата это объем, для ДГ это вес</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыХарактеристик/алк_ПараметрыХарактеристик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыХарактеристик</name>
  <resources>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </resources>
  <resources>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </resources>
  <resources>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </resources>
  <resources>
    <name>Поверхность</name>
    <type>
      <types>CatalogRef.Поверхности</types>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.Влажность</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <comment>Расчетный объем одной штуки исходя из размера. Заполняется при записи набора</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Catalogs/алк_ПроизводственныеКатегорииНоменклатуры/алк_ПроизводственныеКатегорииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_ПроизводственныеКатегорииНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДиапазонС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДиапазонПо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДляВсехПород</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сорта</name>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Породы</name>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Длины</name>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/CommonForms/алк_ФормаПодбораПроизводственныхКатегорий/Module.bsl
//заполнение параметров запроса
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Классификация = Константы.алк_СтандартнаяГруппаПроизводственныхКатегорий; 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	алк_ПроизводственныеКатегорииНоменклатуры.Родитель КАК Группа,
	               |	алк_ПроизводственныеКатегорииНоменклатуры.Ссылка КАК Категория,
	               |	алк_ПроизводственныеКатегорииНоменклатурыДлины.Длина КАК Длина,
	               |	алк_ПроизводственныеКатегорииНоменклатурыПороды.Порода КАК Порода,
	               |	алк_ПроизводственныеКатегорииНоменклатурыСорта.Сорт КАК Сорт,
	               |	алк_ПроизводственныеКатегорииНоменклатуры.ДляВсехПород КАК ДляВсехПород,
	               |	алк_ПроизводственныеКатегорииНоменклатуры.ДиапазонС КАК ДиапазонС,
	               |	алк_ПроизводственныеКатегорииНоменклатуры.ДиапазонПо КАК ДиапазонПо,
	               |	алк_ПроизводственныеКатегорииНоменклатуры.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ Категории
	               |ИЗ
	               |	Справочник.алк_ПроизводственныеКатегорииНоменклатуры КАК алк_ПроизводственныеКатегорииНоменклатуры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПроизводственныеКатегорииНоменклатуры.Сорта КАК алк_ПроизводственныеКатегорииНоменклатурыСорта
	               |		ПО алк_ПроизводственныеКатегорииНоменклатуры.Ссылка = алк_ПроизводственныеКатегорииНоменклатурыСорта.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПроизводственныеКатегорииНоменклатуры.Породы КАК алк_ПроизводственныеКатегорииНоменклатурыПороды
	               |		ПО алк_ПроизводственныеКатегорииНоменклатуры.Ссылка = алк_ПроизводственныеКатегорииНоменклатурыПороды.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПроизводственныеКатегорииНоменклатуры.Длины КАК алк_ПроизводственныеКатегорииНоменклатурыДлины
	               |		ПО алк_ПроизводственныеКатегорииНоменклатуры.Ссылка = алк_ПроизводственныеКатегорииНоменклатурыДлины.Ссылка
	               |ГДЕ
	               |	НЕ алк_ПроизводственныеКатегорииНоменклатуры.ЭтоГруппа
	               |	И алк_ПроизводственныеКатегорииНоменклатуры.Родитель.Родитель = &Группа
	               |	И НЕ алк_ПроизводственныеКатегорииНоменклатуры.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Категории.Группа КАК Группа,
	               |	Категории.Категория КАК Категория,
	               |	NULL КАК Порода,
	               |	NULL КАК Длина,
	               |	NULL КАК Сорт,
	               |	NULL КАК Сечение,
	               |	NULL КАК Количество,
	               |	алк_ОстаткиЗапасовОстатки.КоличествоОстаток КАК ОбъемКонечныйОстаток
	               |{ВЫБРАТЬ
	               |	ОбъемКонечныйОстаток,
	               |	Категория.*}
	               |ИЗ
	               |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	               |			,
	               |			Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	               |				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |				И Штабель = &Штабель) КАК алк_ОстаткиЗапасовОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Категории КАК Категории
	               |		ПО алк_ОстаткиЗапасовОстатки.Номенклатура = Категории.Номенклатура
	               |{ГДЕ
	               |	алк_ОстаткиЗапасовОстатки.Организация.*,
	               |	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница.*,
	               |	алк_ОстаткиЗапасовОстатки.Штабель.*,
	               |	алк_ОстаткиЗапасовОстатки.Номенклатура.*,
	               |	алк_ОстаткиЗапасовОстатки.Характеристика.*,
	               |	алк_ОстаткиЗапасовОстатки.Сертификат.*,
	               |	алк_ОстаткиЗапасовОстатки.СерийныйНомер.*,
	               |	(ЕСТЬNULL(Категории.Группа, ""Без группы"")).* КАК Группа,
	               |	(ЕСТЬNULL(Категории.Категория, ""Без категории"")).* КАК Категория}
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Категории.Группа,
	               |	Категории.Категория,
	               |	алк_ПараметрыХарактеристик.Порода,
	               |	алк_ПараметрыХарактеристик.Длина,
	               |	алк_ПараметрыХарактеристик.Сорт,
	               |	алк_ПараметрыХарактеристик.Сечение,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 0) = 0
	               |			ТОГДА алк_ОстаткиЗапасовОстатки.КоличествоОстаток
	               |		ИНАЧЕ ВЫРАЗИТЬ(алк_ОстаткиЗапасовОстатки.КоличествоОстаток / алк_ПараметрыХарактеристик.Объем КАК ЧИСЛО(20, 0))
	               |	КОНЕЦ,
	               |	алк_ОстаткиЗапасовОстатки.КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	               |			,
	               |			Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	               |				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |				И Штабель = &Штабель) КАК алк_ОстаткиЗапасовОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Категории КАК Категории
	               |			ПО алк_ПараметрыХарактеристик.Сорт = Категории.Сорт
	               |				И алк_ПараметрыХарактеристик.Длина = Категории.Длина
	               |				И алк_ПараметрыХарактеристик.Сечение.ДиаметрММ >= Категории.ДиапазонС
	               |				И алк_ПараметрыХарактеристик.Сечение.ДиаметрММ <= Категории.ДиапазонПо
	               |				И (ВЫБОР
	               |					КОГДА Категории.ДляВсехПород
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ Категории.Порода = алк_ПараметрыХарактеристик.Порода
	               |				КОНЕЦ)
	               |		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	               |{ГДЕ
	               |	алк_ОстаткиЗапасовОстатки.Организация.*,
	               |	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница.*,
	               |	алк_ОстаткиЗапасовОстатки.Штабель.*,
	               |	алк_ОстаткиЗапасовОстатки.Номенклатура.*,
	               |	алк_ОстаткиЗапасовОстатки.Характеристика.*,
	               |	алк_ОстаткиЗапасовОстатки.Сертификат.*,
	               |	алк_ОстаткиЗапасовОстатки.СерийныйНомер.*,
	               |	(ЕСТЬNULL(алк_ПараметрыХарактеристик.Порода, """")).* КАК Порода,
	               |	алк_ПараметрыХарактеристик.Сорт.*,
	               |	алк_ПараметрыХарактеристик.Длина.*,
	               |	алк_ПараметрыХарактеристик.Сечение.*,
	               |	алк_ПараметрыХарактеристик.Влажность.*,
	               |	(ЕСТЬNULL(Категории.Группа, ""Без группы"")).* КАК Группа,
	               |	(ЕСТЬNULL(Категории.Категория, ""Без категории"")).* КАК Категория}
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Группа,
	               |	Категория
	               |ИТОГИ
	               |	СУММА(Количество),
	               |	СУММА(ОбъемКонечныйОстаток)
	               |ПО
	               |	Группа,
	               |	Категория,
	               |	Порода,
	               |	Длина,
	               |	Сорт,
	               |	Сечение";
	
	  Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Параметры.СтруктурнаяЕдиница); 
	  Запрос.УстановитьПараметр("Штабель", Параметры.Штабель);
	  Запрос.УстановитьПараметр("Группа", Классификация); 
	  
	  ДеревоКатегорий = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	  
	  ЗначениеВРеквизитФормы(ДеревоКатегорий, "СписокКатегорий1");

	//СписокКатегорий.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиница", Параметры.СтруктурнаяЕдиница);
	//СписокКатегорий.Параметры.УстановитьЗначениеПараметра("Штабель", Параметры.Номер);     
	//СписокКатегорий.Параметры.УстановитьЗначениеПараметра("Группа", Классификация);   

	ВывестиПодвал();
	
КонецПроцедуры 

&НаСервере
Процедура ВывестиПодвал()
	
	ИтогОбъем = СписокКатегорий1.Итог("Объем");
	ИтогКоличество = СписокКатегорий1.Итог("Количество");
	
	Элементы.СписокКатегорий1.ТекстПодвала = ИтогОбъем;   
	Элементы.СписокКатегорий1.ТекстПодвала = ИтогКоличество;  
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКатегорийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
				
	ТекущаяКатегория = Элементы.СписокКатегорий.ТекущиеДанные.Категория;
	
	Для Каждого эл ИЗ ПодобратьХарактеристикиПоКатегории(ТекущаяКатегория) Цикл 
		
		СтрокаСпискаХарактеристик = ПодобранныеХарактеристики.Добавить();
		СтрокаСпискаХарактеристик.Характеристика = эл.Характеритсика; //добавить процедуры при выборе характе + при измен-е кол-о

	КонецЦикла;
	
		
	//ВывестиПодвал(); //надо пересчитывать остаток по категории при добавлении характеристики

КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПодобратьХарактеристикиПоКатегории(Категория) 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ПроизводственныеКатегорииНоменклатуры.Номенклатура,
	               |	алк_ПроизводственныеКатегорииНоменклатуры.ДиапазонС,
	               |	алк_ПроизводственныеКатегорииНоменклатуры.ДиапазонПо,
	               |	алк_ПроизводственныеКатегорииНоменклатуры.ДляВсехПород,
	               |	алк_ПроизводственныеКатегорииНоменклатурыСорта.Сорт,
	               |	алк_ПроизводственныеКатегорииНоменклатурыПороды.Порода,
	               |	алк_ПроизводственныеКатегорииНоменклатурыДлины.Длина
	               |ПОМЕСТИТЬ ДанныеПоКатегории
	               |ИЗ
	               |	Справочник.алк_ПроизводственныеКатегорииНоменклатуры КАК алк_ПроизводственныеКатегорииНоменклатуры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПроизводственныеКатегорииНоменклатуры.Сорта КАК алк_ПроизводственныеКатегорииНоменклатурыСорта
	               |		ПО алк_ПроизводственныеКатегорииНоменклатурыСорта.Ссылка = алк_ПроизводственныеКатегорииНоменклатуры.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПроизводственныеКатегорииНоменклатуры.Породы КАК алк_ПроизводственныеКатегорииНоменклатурыПороды
	               |		ПО алк_ПроизводственныеКатегорииНоменклатуры.Ссылка = алк_ПроизводственныеКатегорииНоменклатурыПороды.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алк_ПроизводственныеКатегорииНоменклатуры.Длины КАК алк_ПроизводственныеКатегорииНоменклатурыДлины
	               |		ПО алк_ПроизводственныеКатегорииНоменклатуры.Ссылка = алк_ПроизводственныеКатегорииНоменклатурыДлины.Ссылка
	               |ГДЕ
	               |	алк_ПроизводственныеКатегорииНоменклатуры.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	алк_ПараметрыХарактеристик.Характеристика
	               |ИЗ
	               |	ДанныеПоКатегории КАК ДанныеПоКатегории
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	               |		ПО ДанныеПоКатегории.Сорт = алк_ПараметрыХарактеристик.Сорт
	               |			И ДанныеПоКатегории.Порода = алк_ПараметрыХарактеристик.Порода
	               |			И ДанныеПоКатегории.Длина = алк_ПараметрыХарактеристик.Длина
	               |			И ДанныеПоКатегории.ДиапазонС >= алк_ПараметрыХарактеристик.Сечение.ДиаметрММ
	               |			И ДанныеПоКатегории.ДиапазонПо <= алк_ПараметрыХарактеристик.Сечение.ДиаметрММ
	               |ГДЕ
	               |	НЕ ДанныеПоКатегории.ДляВсехПород
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	алк_ПараметрыХарактеристик.Характеристика
	               |ИЗ
	               |	ДанныеПоКатегории КАК ДанныеПоКатегории
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	               |		ПО ДанныеПоКатегории.Сорт = алк_ПараметрыХарактеристик.Сорт
	               |			И ДанныеПоКатегории.Длина = алк_ПараметрыХарактеристик.Длина
	               |			И ДанныеПоКатегории.ДиапазонС >= алк_ПараметрыХарактеристик.Сечение.ДиаметрММ
	               |			И ДанныеПоКатегории.ДиапазонПо <= алк_ПараметрыХарактеристик.Сечение.ДиаметрММ
	               |ГДЕ
	               |	ДанныеПоКатегории.ДляВсехПород";
	
	Возврат Запрос.Выполнить().Выгрузить(); //ТЗ в Массив + добавить для категорий без характеристик + неопределенно?
	
КонецФункции
